Opentrons/opentrons-modules/stm32-modules/heater-shaker/firmware/motor_task/motor_hardware.c
void motor_hardware_plate_lock_on(TIM_HandleTypeDef* tim3, float power) {
  float power_scale = fabs(power);
  if (power_scale > 1.f) {
    power_scale = 1.f;
  }
  TIM_OC_InitTypeDef chan_config = {
     .OCMode = TIM_OCMODE_PWM1,
     .Pulse = (uint16_t)(PLATE_LOCK_PWM_GRANULARITY * power_scale),
     .OCPolarity = TIM_OCPOLARITY_HIGH,
     .OCIdleState = TIM_OCIDLESTATE_RESET
};
  uint32_t active_channel = ((power < 0) ? PLATE_LOCK_IN_1_Chan : PLATE_LOCK_IN_2_Chan);
  uint32_t passive_channel = ((power < 0) ? PLATE_LOCK_IN_2_Chan : PLATE_LOCK_IN_1_Chan);
  HAL_TIM_PWM_Stop(tim3, active_channel);
  HAL_TIM_PWM_Stop(tim3, passive_channel);
  HAL_TIM_PWM_ConfigChannel(tim3, &chan_config, active_channel);
  chan_config.OCMode = TIM_OCMODE_FORCED_INACTIVE;
  HAL_TIM_PWM_ConfigChannel(tim3, &chan_config, passive_channel);
  HAL_TIM_GenerateEvent(tim3, TIM_EVENTSOURCE_UPDATE);
  HAL_TIM_PWM_Start(tim3, passive_channel);
  HAL_TIM_PWM_Start(tim3,  active_channel);
}

void motor_hardware_plate_lock_off(TIM_HandleTypeDef* tim3) {
  TIM_OC_InitTypeDef chan_config = {
     .OCMode = TIM_OCMODE_FORCED_INACTIVE,
     .Pulse = 0,
     .OCPolarity = TIM_OCPOLARITY_HIGH,
     .OCIdleState = TIM_OCIDLESTATE_RESET
};
  HAL_TIM_PWM_Stop(tim3, PLATE_LOCK_IN_1_Chan);
  HAL_TIM_PWM_Stop(tim3, PLATE_LOCK_IN_2_Chan);
  HAL_TIM_OC_ConfigChannel(tim3, &chan_config, PLATE_LOCK_IN_1_Chan);
  HAL_TIM_OC_ConfigChannel(tim3, &chan_config, PLATE_LOCK_IN_2_Chan);
  HAL_TIM_GenerateEvent(tim3, TIM_EVENTSOURCE_UPDATE);
  HAL_TIM_PWM_Start(tim3, PLATE_LOCK_IN_1_Chan);
  HAL_TIM_PWM_Start(tim3, PLATE_LOCK_IN_2_Chan);
}

void motor_hardware_plate_lock_brake(TIM_HandleTypeDef* tim3) {
  float power_scale = 1.f;
  TIM_OC_InitTypeDef chan_config = {
     .OCMode = TIM_OCMODE_PWM1,
     .Pulse = (uint16_t)(PLATE_LOCK_PWM_GRANULARITY * power_scale),
     .OCPolarity = TIM_OCPOLARITY_HIGH,
     .OCIdleState = TIM_OCIDLESTATE_RESET
};
  HAL_TIM_PWM_Stop(tim3, PLATE_LOCK_IN_1_Chan);
  HAL_TIM_PWM_Stop(tim3, PLATE_LOCK_IN_2_Chan);
  HAL_TIM_OC_ConfigChannel(tim3, &chan_config, PLATE_LOCK_IN_1_Chan);
  HAL_TIM_OC_ConfigChannel(tim3, &chan_config, PLATE_LOCK_IN_2_Chan);
  HAL_TIM_GenerateEvent(tim3, TIM_EVENTSOURCE_UPDATE);
  HAL_TIM_PWM_Start(tim3, PLATE_LOCK_IN_1_Chan);
  HAL_TIM_PWM_Start(tim3, PLATE_LOCK_IN_2_Chan);
}

/******************************************************************************/
/*                 STM32F3xx Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f3xx.s).                                               */
/******************************************************************************/

/**
  * @brief  This function handles External line 0 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI0_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(PLATE_LOCK_ENGAGED_Pin);
}

/**
  * @brief  This function handles External line 4 interrupt request.
  * @param  None
  * @retval None
  */
void EXTI4_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(PLATE_LOCK_RELEASED_Pin);
}

/**
  * @brief EXTI line detection callbacks
  * @param GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  optical_switch_results results;
  if (GPIO_Pin == PLATE_LOCK_ENGAGED_Pin) {
    results.closed = true;
    results.open = false;
  }
  if (GPIO_Pin == PLATE_LOCK_RELEASED_Pin) {
    results.open = true;
    results.closed = false;
  }
  MOTOR_HW_HANDLE->plate_lock_complete(&results);
}

bool motor_hardware_plate_lock_sensor_read(uint16_t GPIO_Pin)
{
  if (GPIO_PIN_SET == HAL_GPIO_ReadPin(PLATE_LOCK_Port, GPIO_Pin)) {
    return true;
  } else {
    return false;
  }
}

void Error_Handler() {
  while (true) {}
}

#ifdef __cplusplus
} // extern "C"
#endif // __cplusplus
